namespace isdayoff.Contract
{
    public enum Region
    {
        /////////// Russia ////////////
        
        /// Республика Адыгея
        RuAd,
        /// Республика Алтай
        RuAl,
        /// Республика Башкортостан
        RuBa,
        /// Республика Бурятия
        RuBu,
        /// Республика Дагестан
        RuDa,
        /// Республика Ингушетия
        RuIn,
        /// Кабардино-Балкарская Республика
        RuKb,
        /// Республика Калмыкия
        RuKl,
        /// Карачаево-Черкесская Республика
        RuKc,
        /// Республика Коми
        RuKa,
        /// Республика Саха (Якутия)
        RuSa,
        /// Республика Северная Осетия
        RuSe,
        /// Республика Татарстан
        RuTa,
        /// Республика Тыва
        RuTy,
        /// Чеченская Республика
        RuCe,
        /// Чувашская Республика
        RuCu,
        /// Забайкальский край
        RuZab,
        /// Ставропольский край
        RuSta,
        /// Белгородская область
        RuBel,
        /// Пензенская область
        RuPnz,
        /// Саратовская область
        RuSar
    }
}